* develop a recipe to find the max value of a column
** input stream
   #+name: lag
   #+begin_src text
     primary-order-processor primary-order-updates 4          634508005       634520736       12731           consumer-4_/10.96.1.167
     primary-order-processor primary-order-updates 23         634249935       634434991       185056          consumer-4_/10.96.2.176
     primary-order-processor primary-order-updates 22         634465818       634465827       9               consumer-4_/10.96.0.162
     primary-order-processor primary-order-updates 11         634510017       634524308       14291           consumer-4_/10.96.2.184

   #+end_src


   #+name: rebalancing
   #+begin_src text
     Consumer group `primary-order-processor` is rebalancing.
     primary-order-processor primary-order-updates 4          634508005       634520736       12731           consumer-4_/10.96.1.167
     primary-order-processor primary-order-updates 23         634249935       634434991       185056          consumer-4_/10.96.2.176
     primary-order-processor primary-order-updates 22         634465818       634465827       9               consumer-4_/10.96.0.162
     primary-order-processor primary-order-updates 11         634510017       634524308       14291           consumer-4_/10.96.2.184
   #+end_src

** code
   #+name: max-awk
   #+begin_src text
     BEGIN {rebal=0} /rebalancing/ {rebal=1;} {s+=$6} END {if (rebal) print "rebalancing"; else print s;}
   #+end_src

   so we see =rebalancing= when that is what is happening

   #+begin_src shell :results output :noweb yes
     awk '<<max-awk>>' <<EOF
     <<rebalancing>>
     EOF
   #+end_src

   #+RESULTS:
   : rebalancing

   or the count of the lag column when that is what is happening

   #+begin_src shell :results output :noweb yes
     awk '<<max-awk>>' <<EOF
     <<lag>>
     EOF
   #+end_src

   #+RESULTS:
   : 212087

* print a timestamp
  human readable

  this really gets down to using strftime.  Here is a nice [[http://strftime.net/][interactive site for strftime]].

  cache the time value once, so it is not computed each line

  #+begin_src shell :results output :noweb yes
    awk 'BEGIN {ts = strftime("%a %b %e %H:%M:%S %Z %Y", systime())} {s += $6} END{print ts, s}' <<EOF
    <<lag>>
    EOF
  #+END_SRC

  #+RESULTS:
  : Sat Mar 21 17:41:57 PDT 2020 212087

  generate iso8601, including the timezone

  #+begin_src shell :results output :noweb yes
    awk 'BEGIN {ts = strftime("%FT%T%z", systime())} {s += $6} END{print ts, s}' <<EOF
    <<lag>>
    EOF
  #+END_SRC

  #+RESULTS:
  : 2020-03-21T17:47:43-0700 212087

  now with milliseconds

  #+begin_example
    %FT%T.%L%z
  #+end_example

  well, that does not seem to work.

  #+begin_src shell :results output :noweb yes
    gawk 'BEGIN {ts = strftime("%FT%T.%L%z", systime())} {s += $6} END{print ts, s}' <<EOF
    <<lag>>
    EOF
  #+END_SRC

  #+RESULTS:
  : 2020-03-22T21:30:59.L-0700 212087
